from dotenv import load_dotenv
import os
from pathlib import Path

# Абсолютный путь к .env
dotenv_path = Path(__file__).parent / '.env'
load_dotenv(dotenv_path)

TELEGRAM_BOT_TOKEN = "7547982532:AAFInrxpssTY-HxFTkxSRt9xlG2oC1qjEIA"
CHAT_ID = "172648106"
VK_SERVICE_KEY = "e0f13480e0f13480e0f134807be3d8b187ee0f1e0f13480875ad428b4c8cab84fce4036"
VK_ACCESS_TOKEN = "e0f13480e0f13480e0f134807be3d8b187ee0f1e0f13480875ad428b4c8cab84fce4036"

# # Загружаем переменные
# TELEGRAM_BOT_TOKEN = os.getenv("TELEGRAM_BOT_TOKEN")
# CHAT_ID = os.getenv("CHAT_ID")

if TELEGRAM_BOT_TOKEN is None:
    raise ValueError("TELEGRAM_BOT_TOKEN не найден в переменных окружения!")
if CHAT_ID is None:
    raise ValueError("CHAT_ID не найден в переменных окружения!")

# Данные для Telegram Client
API_ID = os.getenv("TELEGRAM_API_ID")
API_HASH = os.getenv("TELEGRAM_API_HASH")
PHONE = os.getenv("PHONE")

# VK токен
VK_SERVICE_KEY = os.getenv("VK_SERVICE_KEY")

NEWS_SITES = [
    "https://www.volgograd.kp.ru/online/",
    "https://gorvesti.ru/",
    "https://vpravda.ru/",
    "https://v1.ru/",
    "https://v102.ru/",
    "https://bloknot-volgograd.ru/",
    "https://novostivolgograda.ru/",
    "https://riac34.ru/news/",
    "https://мтв.онлайн/feed",
]

VK_GROUPS = [
    "ghest_volgograd", # Жесть Волгограда
    "108998119", # Жесть Волгограда MAXIMUM POWER
    "bloknot.volgograd", # Блокнот Волгоград (Новости)
    "volgograd_trv", # ГТРК «Волгоград-ТРВ» | Волгоград 24
    "overheard_volgograd", # Волгоград
    "tipich_volgograd", # Типичный Волгоград
    "volgograd__online", # Волгоград онлайн
    "news34_vlg", # Волгоград | Без цензуры
    "volgrad34", # Новости Волгоград
    "vol_go_grad", # Волгоград Live
    "tvoygorod34", # Твой Волгоград
    "v102ru", # ИА "Высота 102"
    "novostivolgograda_ru", # Новости Волгограда
    "volgograd_chp_dtp" # ЧП и ДТП Волгоград
]

TELEGRAM_CHANNELS = [
    "Volgograda1",
    "volgograd1",
    "bIoknot_vlg",
    "ghestvolgograd",
    "newsv1",
    "NovostiVLG",
    "vlzjest",
    "volgograd_smi"
]


KEYWORDS = [
    "пожар", "ДТП", "ЧС", "авария", "наводнение", "пожарные",
    "возгорание", "спасение", "пламя", "погиб",
    "отключение электричества", "без воды", "коммунальная авария",
    "атака БПЛА", "беспилотники", "происшествие",
    "чрезвычайная ситуация", "катастрофа", "инцидент", "экстренная ситуация",
    "транспортная авария", "транспортная катастрофа", "железнодорожная авария",
    "крушение поезда", "взрыв", "утечка газа", "выброс химических веществ",
    "радиационная авария", "биологическая опасность", "обрушение здания",
    "обрушение моста", "землетрясение", "оползень", "обвал", "снежная лавина",
    "ураган", "буря", "смерч", "торнадо", "шторм", "половодье", "засуха",
    "природный пожар", "лесной пожар", "торфяной пожар", "эпидемия", "пандемия",
    "инфекция", "вспышка болезни", "карантин", "отравление", "бешенство",
    "сибирская язва", "массовая гибель животных", "теракт", "взрывное устройство",
    "атака дрона", "беспилотник", "захват заложников", "стрельба", "диверсия",
    "МЧС", "Главное управление МЧС", "ГУ МЧС", "ГИМС", "ЦУКС", "пожарные",
    "спасатели", "коррупция", "заносы", "Павленко", "Таросян", "Ткачев",
    "взрыв газа", "обрушение крыши", "сход поезда с рельсов", "авария на заводе",
    "авария на химическом предприятии", "утечка нефти", "выброс ядовитых веществ",
    "разрушение дамбы", "разлив нефтепродуктов", "авария на ТЭЦ", "авария на ГЭС",
    "авария на АЭС", "утечка радиации", "токсичное облако", "шквалистый ветер",
    "ледяной дождь", "заморозки", "сильный туман", "град размером с яйцо",
    "резкое похолодание", "резкое потепление", "рекордная жара", "резкое понижение уровня воды",
    "засоление почвы", "массовое отравление", "вспышка холеры", "вспышка чумы",
    "массовый падеж скота", "гибель птиц", "птичий грипп", "африканская чума свиней",
    "массовое заболевание среди детей", "опасные насекомые", "нашествие саранчи",
    "мутированные вирусы", "самодельное взрывное устройство", "стрельба в общественном месте",
    "нападение на сотрудников полиции", "поджог здания", "нападение с ножом", "взрыв в метро",
    "угон самолёта", "попытка теракта", "перебои с теплом", "замёрзшие трубы", "разрыв теплотрассы",
    "массовый потоп в городе", "порыв водопровода", "затопленный подъезд", "отключение отопления",
    "порыв газопровода", "просадка грунта", "снегопад", "электроснабжение", "пожароопасный", "противопожарный",
    "утонул", "сбил пешехода", "загорелась", "сгорел", "поджигатель", "сжигание", "маломерных судов",
    "сигнал бедствия", "массовое отключение", "уровень опасности"
]
# Слова, при наличии которых новость НЕ будет учитываться
EXCLUDED_KEYWORDS = {
    "СВО", "спецоперация", "специальная операция", "специальная военная операция", "спецоперации"
}
